<center> <h1>Assignment 1</h1> </center>

## Part 1
The following code loads the nba dataset (nba.csv) from an online repository into a dataframe named "nba".

The columns are organized as "Name",	"Team",	"Number",	"Position",	"Age",	"Height",	"Weight",	"College",	"Salary". Use this dataset to answer the questions below.

In [68]:
import pandas as pd
nba = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv") 
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

### Questions 1: 
Create a new dataframe named "nba_new" by adding a new column named "College Degree" right before the column "College". Fill the rows of this column with "True" if there is a college name entry under the column "College" for the associated row.<br/>
1) Make sure the new column named "College Degree" is located right before the column "College".<br/>
2) Report the first 5 rows of nba_new dataframe.<br/>
3) Make sure the new column is of data type boolean and report it is actually boolean.<br/>
4) Create a list that holds the names of the players who do not have any college degree (or no university name entry given under "College" column in the data set) through using a for loop and if statement. Report only the number of those players.<br/>
5) Create two dataframes named "no_college_degree" and "with_college_degree". no_college_degree dataframe should include two columns one for names and one for salaries of those players who do not hold a college degree. Likewise, with_college_degree dataframe should include two columns one for names and one for salaries of those players who do not hold a college degree. Report the first 5 rows of each dataframe. Use for loop and if statement in your solution.<br/>
6) Report the average salary of players with college and no college degrees.<br/>
7) Rename column named "Height" to "Height (feet-inches)". Add a new column named "Height (inches)" to the existing dataframe. The column should include values in total inches. Say, for example, if a player's height is 6-0, the new column should show it as 72. Add another column named "Tall" to the existing dataframe. This column should indicate a bool type value of True if the associated player height is greater than or equal to 80 inches. Otherwise, its value should be False. Use for loop and if statement in your solution.<br/>
8) By using the dataframe with the new column "Tall", report the agerage salaries of players who are labeled as 'True' under Tall column. Also, report the average salaries of players who are labeled as 'False' under Tall column.<br/>
9) Add a new column named "Young" to the existing dataframe. This column should indicate a bool type value of True if the associated player age is less than 30. Otherwise, its value should be False. Use for loop and if statement in your solution.<br/>
10) By using the dataframe with the new column "Young", report the average salaries of players who are labeled as 'True' under Young column. Also, report the average salaries of players who are labeled as 'False' under Young column.<br/>

## Solution- 1 and 2:

In [73]:
nba_new_dict = nba.to_dict() #convert the current dataframe into a dict
nba_new = pd.DataFrame(nba_new_dict) #create a new dataframe with a name "nba_new"
nba_new[['College Degree']] = ~(nba[['College']].isna()) #create column named "College Degree" True and False
nba_new = nba_new[['Name','Team','Number','Position','Age','Height','Weight','College Degree','College','Salary']] #reorganize the existing columns
nba_new.head()

,Name,Team,Number,Position,Age,Height,Weight,College Degree,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,True,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,True,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,True,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,True,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,False,NaN,5000000.0

## Solution-3:
Either one of the following methods would work.

In [20]:
nba_new['College Degree'].dtype

dtype('bool')

In [33]:
nba_new.dtypes

Name               object
Team               object
Number            float64
Position           object
Age               float64
Height             object
Weight            float64
College Degree       bool
College            object
Salary            float64
dtype: object

In [49]:
#If your original new_nba dataframe had object (string) type, then the following would be a solution.
row_index = 0
for s in nba_new['College Degree']:
    if s == 'True':
         s=bool(1)
    elif s == 'False':
         s=bool(0)
    nba_new.loc[[row_index]][['College Degree']] = s
    row_index = row_index + 1

nba_new.dtypes

Name               object
Team               object
Number            float64
Position           object
Age               float64
Height             object
Weight            float64
College Degree       bool
College            object
Salary            float64
dtype: object

In [56]:
nba_new[['College Degree']] = nba_new[['College Degree']].astype('str') #convert bool to str
nba_new.dtypes

Name               object
Team               object
Number            float64
Position           object
Age               float64
Height             object
Weight            float64
College Degree     object
College            object
Salary            float64
dtype: object

In [58]:
nba_new[['College Degree']] = nba_new[['College Degree']].astype('bool') #convert str to bool
nba_new.dtypes

Name               object
Team               object
Number            float64
Position           object
Age               float64
Height             object
Weight            float64
College Degree       bool
College            object
Salary            float64
dtype: object

# Solution-4:

In [118]:
row_index = 0
my_list = []
for s in nba_new['College Degree']:
    if s == False:
        playerName = nba_new.loc[row_index, 'Name'] 
        my_list.append(playerName) 
    row_index = row_index + 1

print(len(my_list))

85

# Solution-5:

In [130]:
import pandas as pd
row_index = 0
my_list1 = []
my_list2 = []
for s in nba_new['College Degree']:
    if s == False:
        playerName = nba_new.loc[row_index, 'Name'] 
        playerSalary = nba_new.loc[row_index, 'Salary']
        my_list1.append(playerName) 
        my_list2.append(playerSalary)
    row_index = row_index + 1

my_dict = {'Name':my_list1, 'Salary':my_list2}
no_college_degree = pd.DataFrame(my_dict)
no_college_degree.head()

                     Name      Salary
0           Jonas Jerebko   5000000.0
1            Amir Johnson  12000000.0
2        Bojan Bogdanovic   3425510.0
3          Sergey Karasev   1599840.0
4  Thanasis Antetokounmpo     30888.0

In [131]:
import pandas as pd
row_index = 0
my_list1 = []
my_list2 = []
for s in nba_new['College Degree']:
    if s == True:
        playerName = nba_new.loc[row_index, 'Name'] 
        playerSalary = nba_new.loc[row_index, 'Salary']
        my_list1.append(playerName) 
        my_list2.append(playerSalary)
    row_index = row_index + 1

my_dict = {'Name':my_list1, 'Salary':my_list2}
with_college_degree = pd.DataFrame(my_dict)
with_college_degree.head()

            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN
3    R.J. Hunter  1148640.0
4  Jordan Mickey  1170960.0

# Solution-6:

In [132]:
#Average player salary with no college degree
no_college_degree.Salary.mean()

5829803.426829268

In [133]:
#Agerage player salary with a college degree
with_college_degree.Salary.mean()

4620311.071428572